import os

# 1. КЛЮЧІ ДОСТУПУ (Шорткати)
# Залишено лише одну папку. Пошук іде за коренем "секретн"
MY_FOLDERS = {
    "секретн": os.getenv("JARVIS_SECRET_DIR", r"D:\Sicrets")
}

# Тригери для запуску навички
TRIGGERS = [
    "досліджуй папку",
    "досліджуй директорію",
    "переглянь папку",
    "переглянь директорію",
    "скануй вміст папки",
    "скануй вміст директорії",
    "інформація про папку",
    "інформація про директорію",
    "назви файли в папці",
    "назви файли в директорії",
    "показати вміст папки",
    "показати вміст директорії",
]